const belarusian: { readonly [x: string]: string } = {
    language: 'БЕЛАРУСКАЯ',

    githubLinkFirstTeammate: 'Юрый Андрабайла',
    githubLinkSecondTeammate: 'Аляксандр Рылькоў',
    githubLinkThirdTeammate: 'Павел Паляшчук',
    applicationCreationYear: '2023',

    startPageTitle: 'Паехалі!',
    startPageText: 'Вы хочаце стварыць новы гурт ці далучыцца да існуючага?',
    startPageButtonNew: 'Новы гурт',
    startPageButtonJoin: 'Далучыцца да гурту',

    headerLeftButton: 'Агляд',
    headerRightButton: 'Выдаткі',
    burgerTop: 'Гурты',
    burgerFeedback: 'Водгук',
    burgerAbout: 'Пра нас',
    dottedTotal: 'Iнструкцыя',
    dottedAdd: 'Дадаць групавое фота',
    dottedChangeName: 'Змяніць імя',
    dottedChangeCurrency: 'Змяніць валюту',
    dottedLeaveGroup: 'Пакінуць групу',
    penButton: 'Гатова',

    CancelButton: 'Адмена',
    leaveButton: 'Выйсці',
    leaveGroupButton: 'Пакінуць гурт?',

    newGroupButton: 'Новы гурт',
    choiceGroupButton: 'Выбар гурту',
    makeChoiceButton: 'Зрабіць выбар',

    buttonCreate: 'СТВАРЫЦЬ',
    placeholderNewGroup: 'Імя',
    buttonCurrency: 'Валюта',
    currency: 'BYN',
    addGroupTitle: 'Увядзіце назву гурта',
    errorMessageAddGroup: 'Памылка запыту на даданне гурту!',

    buttonJoin: 'ДАЛУЧЫЦЦА',
    placeholderJoinGroup: 'код',
    joinPageText: 'Увядзіце код',

    buttonInvite: 'ЗАПРАСІЦЬ',
    buttonCopy: 'КАПІРАВАЦЬ',
    buttonLater: 'ПАЗНЕЙ',

    inviteText: 'Іншыя могуць атрымаць доступ да вашага гурту, выкарыстоўваючы гэты код',
    confirmingMessage: 'Код паспяхова скапіяваны ў буфер абмену',

    btnEdit: 'Рэдагаваць',
    btnDone: 'ГАТОВА',
    balance: 'Баланс',
    expenses: 'Выдаткі',
    payments: 'Плацяжы',
    benefitsFrom: 'Ад каго',
    deletePerson: 'Выдаліць',
    btnCancel: 'Адмена',
    btnDelete: 'Выдаліць',
    joinGroup: 'Далучыцца да гурту',

    buttonAdd: '+',
    popupTitleNewExpense: 'Новы выдатак',
    popupTitleNewPayment: 'Новы плацёж',
    popupTextNewExpense: 'Купля для групы',
    popupTextNewPayment: 'Плацеж для групы',
    buttonNewExpense: '⚖',
    buttonNewPayment: '→',

    buttonSave: 'Захаваць',
    textAmount: 'Сума',
    textCurrency: 'Валюта',
    textFrom: 'Ад',
    textTo: 'Для',
    textDate: 'Дата',
    buttonMore: 'Больш',
    buttonLess: 'Менш',

    amount: 'Сума',
    currencies: 'Валюта',
    titleExpense: 'Назва',
    by: 'Кім',
    forWhom: 'Для',
    from: 'Ад',
    to: 'Каму',
    date: 'Дата',
    persons: 'асобы',
    payment: 'Аплата',

    noGroupMessage: 'На жаль, няма групы з нумарам ',

    createUserGreeting: 'Прадстаўцеся',
    createUserButton: 'Увайсці',
    errorMessageAddNewUser: 'Cервер не даступны',

    buttonBack: 'Вярнуцца',
    instructionText: `Дадатак прызначана для ажыццяўлення ўзаемаразлікаў унутры групы людзей.<br><br>
    Інструкцыя: <br><br>
    1. Пры першым уваходзе на сайт прыкладанне запытвае ваша імя. Яно ж будзе адлюстроўвацца ва ўсіх групах у якіх вы будзеце складацца.<br><br>
    2. Пасля гэтага адкрыецца старонка дзе перад вамі будзе выбар далучыцца да ўжо існуючай групе або стварыць новую. <br>
    --Пры стварэнні новай групы неабходна будзе ўказаць назву групы і валюту ў якой далей будзе адбывацца разлік усярэдзіне груп. <br>
    --Пры далучэнні да групы неабходна ўказаць id які вам павінен прадаставіць іншы карыстальнік, які ўжо знаходзіцца ўнутры групы. <br><br>
    3. Пасля дадання ў групу адкрыецца асноўная старонка прыкладання. На ёй размешчаны<br>
    --Меню карыстальніка, у якім паказваецца пералік груп карыстальніка і пры кліку па назве канкрэтнай групы адбываецца пераход у яе. Гэтак жа пры кліку па "+", адчыняецца старонка дзе можна стварыць новую або далучыцца да ўжо існай групы. <br>
    --Старонка "Overview". На ёй размешчаны пералік карыстальнікаў з іх бягучым балансам. Прысутнічае кнопка "Invite" пры кліку па якой адкрыецца акно з id групы, менавіта яго неабходна падаць іншаму карыстачу для таго што б ён змог дадацца ў гэтую групу. <br>
    --Старонка "Expenses". На ёй размешчаны пералік усіх пакупак групы. Пры зграі па куплі адкрыецца больш падрабязная інфармацыя пра яе. <br><br>
    4. На старонцы "Overview" гэтак жа размешчана кнопка "+". Пры кліку адкрыецца меню, дзе можна дадаць новую пакупку. <br>
    --"Add expense". Неабходная ў выпадку, калі карыстач купляе нешта для ўсёй групы. Пры кліку адкрываецца старонка дадання пакупкі, у якой неабходна ўказаць назву пакупкі, яе кошт і выбраць, хто робіць пакупку. Пасля націску на кнопку "Save" адбываецца захаванне пакупкі і пераразлік балансу карыстальнікаў. Карыстальніку хто здзейсніў куплю дадаецца лік роўнае суме якую павінны карыстальніку іншыя карыстальнікі. <br>
    --"Add payment". Неабходна калі пакупка здзяйсняецца для нейкага аднаго карыстальніка ў групе. Пры кліку адкрываецца старонка дадання пакупкі у якой неабходна паказаць кошт пакупкі выбраць хто здзяйсняе пакупку і для каго. Пасля націску на кнопку "Save" адбываецца захаванне пакупкі і пераразлік балансу карыстальнікаў. Карыстальніку хто здзейсніў куплю дадаецца лік роўнае палове кошту пакупкі, у карыстальніка які павінен адпаведна адымаецца дадзеная сума. <br><br>
    Прыносім найглыбокія выбачэнні, але, нажаль, прыкладанне, па некаторых чынніках, яшчэ не завершанае і працягвае распрацоўвацца. <br>`,
};

export default belarusian;
